---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetUpdatingSharedParameters
source: html/7a5ecdb0-a5cd-e64b-1640-c4c03cd16a25.htm
---
# Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetUpdatingSharedParameters Method

Get the shared parameters listed as dependencies in the calculation of the rebar curves

## Syntax (C#)
```csharp
public IList<ElementId> GetUpdatingSharedParameters()
```

## Returns
Returns the elementIds of the shared parameters